{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 56. Черепахи\n",
    "\n",
    "Широко известна следующая задача для младших школьников. Три черепахи ползут по дороге. Одна черепаха говорит: «Впереди меня две черепахи». Другая черепаха говорит: «Позади меня две черепахи». Третья черепаха говорит: «Впереди меня две черепахи и позади меня две черепахи». Как такое может быть? Ответ: третья черепаха врет!\n",
    "\n",
    "По дороге одна за другой движутся N черепах. Каждая черепаха говорит фразу вида: «Впереди меня ai черепах, а позади меня bi черепах». Ваша задача определить, какое максимальное количество черепах могут говорить правду.\n",
    "\n",
    "#### Формат ввода\n",
    "\n",
    "В первой строке вводится целое число N (1 ≤ N ≤ 10000) строк, содержащих целые числа ai и bi, по модулю не превосходящие 10000, описывающие высказывание i-ой черепахи.\n",
    "\n",
    "#### Формат вывода\n",
    "\n",
    "Выведите целое число M — максимальное количество черепах, которые могут говорить правду.\n",
    "\n",
    "#### Примеры\n",
    "\n",
    "Ввод\n",
    "3\n",
    "2 0\n",
    "0 2\n",
    "2 2\n",
    "Вывод\n",
    "2\n",
    "\n",
    "Ввод\n",
    "5\n",
    "0 4\n",
    "1 3\n",
    "2 2\n",
    "3 1\n",
    "4 0\n",
    "Вывод\n",
    "5\n",
    "\n",
    "Ввод\n",
    "10\n",
    "9 1\n",
    "8 1\n",
    "7 2\n",
    "6 2\n",
    "5 3\n",
    "4 4\n",
    "3 6\n",
    "2 7\n",
    "1 9\n",
    "0 8\n",
    "Вывод\n",
    "4"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1\n"
     ]
    }
   ],
   "source": [
    "def main():\n",
    "    N = int(input())\n",
    "    coord = []\n",
    "\n",
    "    for _ in range(N):\n",
    "        num = list(map(int, input().split()))\n",
    "        if num[0] + num[1] + 1 == N and num[0] >= 0 and num[1] >= 0:\n",
    "            coord.append(num)\n",
    "\n",
    "    print(len({tuple(x) for x in coord}))  # переделываем в кортеж, чтобы убрать повторения\n",
    "\n",
    "if __name__ == '__main__':\n",
    "    main()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
