{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 58. OpenCalculator\n",
    "\n",
    "В новой программе OpenCalculator появилась новая возможность – можно настроить, какие кнопки отображаются, а какие – нет. Если кнопка не отображается на экране, то ввести соответствующую цифру с клавиатуры или копированием из другой программы нельзя. Петя настроил калькулятор так, что он отображает только кнопки с цифрами x, y, z. Напишите программу, определяющую, сможет ли Петя ввести число N, а если нет, то какое минимальное количество кнопок надо дополнительно отобразить на экране для его ввода.\n",
    "\n",
    "#### Формат ввода\n",
    "\n",
    "Сначала вводятся три различных числа из диапазона от 0 до 9: x, y и z (числа разделяются пробелами). Далее вводится целое неотрицательное число N, которое Петя хочет ввести в калькулятор. Число N не превышает 10000.\n",
    "\n",
    "#### Формат вывода\n",
    "\n",
    "Выведите, какое минимальное количество кнопок должно быть добавлено для того, чтобы можно было ввести число N (если число может быть введено с помощью уже имеющихся кнопок, выведите 0)\n",
    "\n",
    "#### Примечание\n",
    "\n",
    "Комментарии к примерам тестов.\n",
    "\n",
    "1. Число может быть введено имеющимися кнопками.\n",
    "\n",
    "2. Нужно добавить кнопку 0.\n",
    "\n",
    "3. Нужно добавить кнопки 1 и 2.\n",
    "\n",
    "#### Примеры\n",
    "\n",
    "Ввод\n",
    "1 2 3\n",
    "1123\n",
    "Вывод\n",
    "0\n",
    "\n",
    "\n",
    "Ввод\n",
    "1 2 3\n",
    "1001\n",
    "Вывод\n",
    "1\n",
    "\n",
    "\n",
    "Ввод\n",
    "5 7 3\n",
    "123\n",
    "Вывод\n",
    "2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2\n"
     ]
    }
   ],
   "source": [
    "def main():\n",
    "    x, y, z = map(int, input().split())\n",
    "    num = list(set(map(int, str(int(input())))))\n",
    "\n",
    "    count = 0\n",
    "    for i in range(len(num)):\n",
    "        if num[i] != x and num[i] != y and num[i] != z:\n",
    "            count += 1\n",
    "\n",
    "    print(count)\n",
    "\n",
    "if __name__ == '__main__':\n",
    "    main()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
