{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 67 Симметричная последовательность\n",
    "Последовательность чисел назовём симметричной, если она одинаково читается как слева направо, так и справа налево. Например, следующие последовательности являются симметричными:\n",
    "\n",
    "1 2 3 4 5 4 3 2 1\n",
    "\n",
    "1 2 1 2 2 1 2 1\n",
    "\n",
    "Вашей программе будет дана последовательность чисел. Требуется определить, какое минимальное количество и каких чисел надо приписать в конец этой последовательности, чтобы она стала симметричной.\n",
    "\n",
    "#### Формат ввода\n",
    "\n",
    "Сначала вводится число N — количество элементов исходной последовательности (1 ≤ N ≤ 100). Далее идут N чисел — элементы этой последовательности, натуральные числа от 1 до 9.\n",
    "\n",
    "#### Формат вывода\n",
    "\n",
    "Выведите сначала число M — минимальное количество элементов, которое надо дописать к последовательности, а потом M чисел (каждое — от 1 до 9) — числа, которые надо дописать к последовательности.\n",
    "\n",
    "#### Примеры\n",
    "Ввод\n",
    "9\n",
    "1 2 3 4 5 4 3 2 1\n",
    "Вывод\n",
    "0\n",
    "\n",
    "Ввод\n",
    "5\n",
    "1 2 1 2 2\n",
    "Вывод\n",
    "3\n",
    "1 2 1\n",
    "\n",
    "Ввод\n",
    "5\n",
    "1 2 3 4 5\n",
    "Вывод\n",
    "4\n",
    "4 3 2 1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "\n",
    "\n",
    "def main():\n",
    "    N = int(input())\n",
    "    list_n = list(map(int, input().split()))\n",
    "\n",
    "    if list_n == list_n[::-1]:\n",
    "        print(0)\n",
    "\n",
    "    else:\n",
    "        add = []\n",
    "        for i in range(N):\n",
    "            add.append(list_n[i])\n",
    "            list_new = list_n + add[::-1]\n",
    "            if list_new == list_new[::-1]:\n",
    "                print(i + 1)\n",
    "                for num in add[::-1]:\n",
    "                    print(num, end=\" \")\n",
    "                break\n",
    "\n",
    "if __name__ == '__main__':\n",
    "    main()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
