{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 68 Чемпионат по метанию коровьих лепешек\n",
    "\n",
    "Ежегодный турнир «Веселый коровяк» — по метанию коровьих лепешек на дальность — прошёл 8–9 июля в селе Крылово Осинского района Пермского края.\n",
    "\n",
    "Участники соревнований кидают «снаряд» — спрессованный навоз, выбирая его из заранее заготовленной кучи. Желающих поупражняться в силе броска традиционно очень много — как мужчин, так и женщин. Каждую лепешку, которую метнули участники «Веселого коровяка», внимательно осматривали женщины в костюмах коров и тщательно замеряли расстояние.\n",
    "\n",
    "Соревнования по метанию коровьих лепешек проводятся в Пермском крае с 2009 года.\n",
    "\n",
    "К сожалению, после чемпионата потерялись записи с фамилиями участников, остались только записи о длине броска в том порядке, в котором их совершали участники.\n",
    "\n",
    "Тракторист Василий помнит три факта:\n",
    "\n",
    "1) Число метров, на которое он метнул лепешку, оканчивалось на 5\n",
    "\n",
    "2) Один из победителей чемпионата метал лепешку до Василия\n",
    "\n",
    "3) Участник, метавший лепешку сразу после Василия, метнул ее на меньшее количество метров\n",
    "\n",
    "Будем считать, что участник соревнования занял k-е место, если ровно (k − 1) участников чемпионата метнули лепешку строго дальше, чем он.\n",
    "\n",
    "Какое максимально высокое место мог занять Василий?\n",
    "\n",
    "#### Формат ввода\n",
    "\n",
    "Первая строка входного файла содержит целое число n — количество участников чемпионата по метанию лепешек (3 ≤ n ≤ 10^5).\n",
    "\n",
    "Вторая строка входного файла содержит n положительных целых чисел, каждое из которых не превышает 1000, — дальность броска участников чемпионата, приведенные в том порядке, в котором происходило метание.\n",
    "\n",
    "#### Формат вывода\n",
    "\n",
    "Выведите самое высокое место, которое мог занять тракторист Василий. Если не существует ни одного участника чемпионата, который удовлетворяет, описанным выше условиям, выведите число 0.\n",
    "\n",
    "#### Примеры\n",
    "Ввод\n",
    "7\n",
    "10 20 15 10 30 5 1\n",
    "Вывод \n",
    "6\n",
    "\n",
    "Ввод\n",
    "3\n",
    "15 15 10\n",
    "Вывод \n",
    "1\n",
    "\n",
    "Ввод\n",
    "3\n",
    "10 15 20\n",
    "Вывод \n",
    "0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5\n"
     ]
    }
   ],
   "source": [
    "import sys\n",
    "\n",
    "\n",
    "def main():\n",
    "    n = int(input())\n",
    "    list_n = list(map(int, input().split()))\n",
    "\n",
    "    sort_list_n = sorted(list_n, reverse=True)\n",
    "    max_n = max(list_n)\n",
    "    for i in range(n):\n",
    "        if list_n[i] == max_n:\n",
    "            index_max = i\n",
    "            break\n",
    "    \n",
    "    index = []\n",
    "    for i in range(index_max, n - 2):\n",
    "        if list_n[i + 1] > list_n[i + 2] and list_n[i + 1] % 10 == 5:\n",
    "            index.append(i + 1)\n",
    "\n",
    "    number = []\n",
    "    if not index:\n",
    "        print(0) \n",
    "    else:\n",
    "        for i in range(len(index)):\n",
    "            number.append(list_n[index[i]])\n",
    "        \n",
    "        max_v = max(number)\n",
    "        for i in range(n):\n",
    "            if sort_list_n[i] == max_v:\n",
    "                k = i + 1\n",
    "                print(k)\n",
    "                break\n",
    "\n",
    "\n",
    "if __name__ == '__main__':\n",
    "    main()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
