{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 82. Кондиционер\n",
    "\n",
    "В офисе, где работает программист Пётр, установили кондиционер нового типа. Этот кондиционер отличается особой простотой в управлении. У кондиционера есть всего лишь два управляемых параметра: желаемая температура и режим работы.\n",
    "\n",
    "Кондиционер может работать в четырёх режимах:\n",
    "\n",
    "1. «freeze» — охлаждение. В этом режиме кондиционер может только уменьшать температуру. Если температура в комнате и так не больше желаемой, то он выключается.\n",
    "\n",
    "2. «heat» — нагрев. В этом режиме кондиционер может только увеличивать температуру. Если температура в комнате и так не меньше желаемой, то он выключается.\n",
    "\n",
    "3. «auto» — автоматический режим. В этом режиме кондиционер может как увеличивать, так и уменьшать температуру в комнате до желаемой.\n",
    "\n",
    "4. «fan» — вентиляция. В этом режиме кондиционер осуществляет только вентиляцию воздуха и не изменяет температуру в комнате.\n",
    "\n",
    "Кондиционер достаточно мощный, поэтому при настройке на правильный режим работы он за час доводит температуру в комнате до желаемой.\n",
    "\n",
    "Требуется написать программу, которая по заданной температуре в комнате t_room, установленным на кондиционере желаемой температуре t_cond и режиму работы определяет температуру, которая установится в комнате через час.\n",
    "\n",
    "#### Формат ввода\n",
    "\n",
    "Первая строка входного файла содержит два целых числа troom, и tcond, разделенных ровно одним пробелом (–50 ≤ t_room ≤ 50, –50 ≤ t_cond ≤ 50).\n",
    "\n",
    "Вторая строка содержит одно слово, записанное строчными буквами латинского алфавита — режим работы кондиционера.\n",
    "\n",
    "#### Формат вывода\n",
    "\n",
    "Выходной файл должен содержать одно целое число — температуру, которая установится в комнате через час.\n",
    "\n",
    "#### Примечание\n",
    "\n",
    "В первом примере кондиционер находится в режиме нагрева. Через час он нагреет комнату до желаемой температуры в 20 градусов.\n",
    "\n",
    "Во втором примере кондиционер находится в режиме охлаждения. Поскольку температура в комнате ниже, чем желаемая, кондиционер самостоятельно выключается и температура в комнате не поменяется.\n",
    "\n",
    "#### Примеры\n",
    "\n",
    "Ввод\n",
    "10 20\n",
    "heat\n",
    "Вывод\n",
    "20\n",
    "\n",
    "Ввод\n",
    "10 20\n",
    "freeze\n",
    "Вывод\n",
    "10"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10\n"
     ]
    }
   ],
   "source": [
    "def main():\n",
    "    t_room, t_cond = map(int, input().split())\n",
    "    mode = input()\n",
    "\n",
    "    if mode == 'fan':\n",
    "        print(t_room)\n",
    "\n",
    "    elif mode == 'auto':\n",
    "        print(t_cond)\n",
    "        \n",
    "    elif mode == 'freeze':\n",
    "        if t_room > t_cond:\n",
    "            print(t_cond)\n",
    "        else:\n",
    "            print(t_room)\n",
    "\n",
    "    elif mode == 'heat':\n",
    "        if t_room >= t_cond:\n",
    "            print(t_room)\n",
    "        else:\n",
    "            print(t_cond)\n",
    "\n",
    "if __name__ == '__main__':\n",
    "    main()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
