{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 84. Пирамида\n",
    "\n",
    "Для строительства двумерной пирамиды используются прямоугольные блоки, каждый из которых характеризуется шириной и высотой.\n",
    "\n",
    "Можно поставить один блок на другой, только если ширина верхнего блока строго меньше ширины нижнего (блоки нельзя поворачивать). Самым нижним в пирамиде может быть блок любой ширины.\n",
    "\n",
    "По заданному набору блоков определите, пирамиду какой наибольшей высоты можно из них построить.\n",
    "\n",
    "#### Формат ввода\n",
    "\n",
    "В первой строке входных данных задается число N — количество блоков (1 ≤ N ≤ 100000).\n",
    "\n",
    "В следующих N строках задаются пары натуральных чисел wi и hi (1 ≤ wi, hi ≤ 10^9) — ширина и высота блока соответственно.\n",
    "\n",
    "#### Формат вывода\n",
    "\n",
    "Выведите одно целое число — максимальную высоту пирамиды.\n",
    "\n",
    "#### Примечание\n",
    "\n",
    "В примере пирамида будет состоять из двух блоков: нижним блоком будет блок номер 3, а верхним — блок номер 2. Блок номер 1 нельзя использовать вместе с блоком номер 3.\n",
    "\n",
    "#### Пример\n",
    "\n",
    "Ввод\n",
    "3\n",
    "3 1\n",
    "2 2\n",
    "3 3\n",
    "Вывод\n",
    "5"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5\n"
     ]
    }
   ],
   "source": [
    "def main():\n",
    "    N = int(input())\n",
    "    bloks = {}\n",
    "\n",
    "    for i in range(N):\n",
    "        w, h = map(int, input().split())\n",
    "        if w in bloks:\n",
    "            if bloks[w] < h:\n",
    "                bloks[w] = h\n",
    "        else:\n",
    "            bloks[w] = h\n",
    "\n",
    "    print(sum(bloks.values()))\n",
    "\n",
    "if __name__ == '__main__':\n",
    "    main()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
