{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 93. Город Че\n",
    "\n",
    "В центре города Че есть пешеходная улица - одно из самых популярных мест для прогулок жителей города. По этой улице очень приятно гулять, ведь вдоль улицы расположено n забавных памятников.\n",
    "\n",
    "Девочке Маше из города Че нравятся два мальчика из её школы, и она никак не может сделать выбор между ними. Чтобы принять окончательное решение, она решила назначить обоим мальчикам свидание в одно и то же время. Маша хочет выбрать два памятника на пешеходной улице, около которых мальчики будут её ждать. При этом она хочет выбрать такие памятники, чтобы мальчики не увидели друг друга. Маша знает, что из-за тумана мальчики увидят друг друга только в том случае, если они будут на расстоянии не более r метров.\n",
    "\n",
    "Маше заинтересовалась, а сколько способов есть выбрать два различных памятника для организации свиданий?\n",
    "\n",
    "#### Формат ввода\n",
    "\n",
    "В первой строке входного файла находятся два целых числа n и r (2 ≤ n ≤ 300000, 1 ≤ r ≤ 10^9) - количество памятников и максимальное расстояние, на котором мальчики могут увидеть друг друга.\n",
    "\n",
    "Во второй строке задано n положительных чисел d1,…,dn, где di- расстояние от i-го памятника до начала улицы. Все памятники находятся на разном расстоянии от начала улицы. Памятники приведены в порядке возрастания расстояния от начала улицы (1 ≤ d1,d2,…, dn ≤ 10^9).\n",
    "\n",
    "#### Формат вывода\n",
    "\n",
    "Выведите одно число - число способов выбрать два памятника для организации свиданий.\n",
    "\n",
    "#### Примечание\n",
    "\n",
    "В приведенном примере Маша может выбрать памятники 1 и 4 или памятники 2 и 4.\n",
    "\n",
    "#### Пример\n",
    "\n",
    "Ввод\n",
    "4 4\n",
    "1 3 5 8\n",
    "Вывод\n",
    "2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2\n"
     ]
    }
   ],
   "source": [
    "# слишком долго\n",
    "n, r = map(int, input().split())\n",
    "list_n = list(map(int, input().split()))\n",
    "count = 0\n",
    "\n",
    "for i, first in enumerate(list_n):\n",
    "    for j, second in enumerate(list_n[i:]):\n",
    "        if second - first > r:\n",
    "            count += len(list_n[i + j:])\n",
    "            break\n",
    "            \n",
    "print(count)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2\n"
     ]
    }
   ],
   "source": [
    "def main():\n",
    "    n, r = map(int, input().split())\n",
    "    list_n = list(map(int, input().split()))\n",
    "    i, j, count = 0, 1, 0\n",
    "\n",
    "    while j < len(list_n) and i < len(list_n) - 1:\n",
    "        if list_n[j] - list_n[i] <= r:\n",
    "            j += 1\n",
    "        else:\n",
    "            count += n - j\n",
    "            i += 1\n",
    "\n",
    "    print(count)\n",
    "\n",
    "if __name__ == '__main__':\n",
    "    main()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
