{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 181. Формирование заплывов\n",
    "\n",
    "Помогите расставить участников соревнований по плаванию. Заплывы формируются по стандартной системе:\n",
    "\n",
    "В заплыве восемь дорожек.\n",
    "\n",
    "Известно заявочное время каждого участника (по этому времени участники распределяются по заплывам).\n",
    "\n",
    "Сначала идут слабейшие заплывы.\n",
    "\n",
    "Внутри заплыва участники расставляются по правилу клина: сильнейшие в центре (лучший заявочный результат - на четвертой дорожке), слабейшие по краям (худший заявочный результат - на восьмой дорожке).\n",
    "\n",
    "Считайте, что заплывы смешанные и разделения участников по полу нет, заявочное время разное у всех участников.\n",
    "\n",
    "После публикации стартовых протоколов оказалось, что одна команда из восьми человек опоздала и её надо срочно добавить в списки. Напишите алгоритм, с помощью которого по громкой связи можно объявить в каких заплывах и по какой дорожке будет плыть каждый участник опоздавшей команды.\n",
    "\n",
    "### Формат ввода\n",
    "Дан файл heats.csv с опоздавшими участниками и уже сформированными заплывами. Опоздавшие участники перечислены в заплыве с номером 0. Далее перечислены участники полных заплывов по восемь человек. Заплывы сформированы по правилам (начиная с первой дорожки):\n",
    "\n",
    "heat,id,time\n",
    "0,301,25.3\n",
    "0,302,24.2\n",
    "0,303,29.2\n",
    "heat — номер заплыва id — идентификатор участника time — заявочное время\n",
    "\n",
    "### Формат вывода\n",
    "Выведите опоздавших участников в первоначальном порядке с указанием заплыва и номера дорожки через запятую.\n",
    "\n",
    "\n",
    "### Формат ответа:\n",
    "301,1,3\n",
    "302,2,4\n",
    "303,3,5\n",
    "304,2,3\n",
    "305,2,7\n",
    "306,3,5\n",
    "307,1,8\n",
    "308,2,1\n",
    "\n",
    "### Примечание\n",
    "Обратите внимание, что это не ответ на задачу, а лишь образец того, в каком формате должен быть отправлен ваш ответ."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "301,3,6\n",
      "302,3,4\n",
      "303,1,8\n",
      "304,1,1\n",
      "305,2,1\n",
      "306,2,2\n",
      "307,1,2\n",
      "308,1,7\n"
     ]
    }
   ],
   "source": [
    "import pandas as pd\n",
    "import numpy as np\n",
    "\n",
    "df = pd.read_csv('heats.csv')\n",
    "df = df.sort_values(by=['time'], ascending=False)\n",
    "\n",
    "num_rows = len(df)\n",
    "num_heat = np.repeat(np.arange(1, (num_rows + 7) // 8 + 1), 8)\n",
    "df['heat_2'] = num_heat[:num_rows]\n",
    "\n",
    "num_track = []\n",
    "one_num_track = [8, 1, 7, 2, 6, 3, 5, 4]\n",
    "\n",
    "for i in range(num_rows):\n",
    "  num_track.append(one_num_track[i % len(one_num_track)])\n",
    "\n",
    "df['track'] = num_track[:num_rows]\n",
    "\n",
    "df_2 = df[df['heat'] == 0].sort_values(by=['id'])\n",
    "df_2 = df_2[['id', 'heat_2', 'track']]\n",
    "for index, row in df_2.iterrows():\n",
    "  print(','.join(map(str, row.values)))\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
